import {
	Alert,
	AlertIcon,
	Badge,
	Box,
	Container,
	Flex,
	Text,
	VStack,
} from "@chakra-ui/react";
import React from "react";
import { Containers } from "../Components";

const About = () => {
	return (
		<>
			<Containers>
				<VStack alignItems={"center"} justifyContent="center">
					<Container maxW={["3xl", "6xl"]}>
						<Flex
							w="100%"
							alignItems={"center"}
							justifyContent={"center"}
							className="section-padding"
						>
							<Box
								backgroundColor={`${"var(--main-color)"}`}
								rounded="md"
								w="100%"
								py="10"
								px="5"
								textAlign={"center"}
							>
								<Text
									fontSize={["md", "lg", "2xl"]}
									fontWeight="700"
									letterSpacing={"1px"}
									py="5"
									borderBottom={"1px solid #777"}
								>
									بيانات و معلومات المزايدات
								</Text>
								<Box
									mt="5"
									fontSize={["16px", "18px", "20px"]}
									lineHeight={1.8}
									letterSpacing="1px"
								>
									<Alert status="warning" color="black" mb="2">
										<AlertIcon />
										المعاينة للموقع علي الطبيعة يوميا ما عدا السبت والجمعة من
										الساعة ١٠ صباحا حتي ٣ عصرا
									</Alert>
									1- رسوم تدفع مرة واحدة فقط بقيمة{" "}
									<Badge colorScheme="green" variant="solid">
										145 جنيه
									</Badge>{" "}
									قيمة رسوم و مصروفات ادارية للحصول على المستندات الخاصة
									بالملكية للاطلاع على كراسة المواصفات و الشروط و طباعتها مع
									وجود رقم كودي بكل كراسة شروط يجب الاحتفاظ بهذا الرقم الكودي
									للدخول من خلاله للحصول على شقة مجانية في نهاية المزايدات يتم
									تحديد موعدها لاحقا بعد الانتهاء من شقق المزايدة و سوف يتم
									الاعلان عن موعدها طبقا للاجرائات القانونية المتبعة و طبقا
									للشروط و الاحكام <br />
									<br /> 2- رسوم بقيمة{" "}
									<Badge variant="solid" colorScheme="green">
										165 جنيه
									</Badge>{" "}
									رسوم نظير مصروفات دخول المزايدة و تكون رسوم دخول المزايدة لكل
									شقة على حدة حيث يتم عمل مزاد لشقتين كل شهرين و تلك رسوم لدخول
									مزايدة واحدة و تحصل من خلالها على كود او رقم سري لدخول
									المزايدة في المواعيد و التواريخ المحددة سابقا في كراسة الشروط
									الفقرة رقم 7 و بند (ب) , (ج) في الفقرة 13
									<br /> <br /> 3- سوف يتم اختيار أحد العملاء الذين قاموا بشراء
									كراسة الشروط للحصول على شقة مجانية مع تحمله لكافة الضرائب
									للشقة لتسجيلها له مع الغلم ان هذه تكون منحة من صاحب العقار في
									حالة الانتهاء وبيع كل الشقق مع العلم ان الاختيار سيكون
									الكترونيا ويحدد له يوم معين وساعة معينة لاختيار العميل الذي
									سوف يتم منحه هذه الشقة المجانية ويكون الاختيار عن طريق الرقم
									الكودي الموجود فب كراسة الشروط وسوف يتم تحديد موعدها بعد
									الانتهاء من بيع جميع الشقق و اتخاذ كافة الإجراءات القانونية
									لتحديد الموعد و الف مبروك مقدما <br /> <br /> 4- ملحوظة رسوم
									كراسات الشروط و المواصفاط{" "}
									<Badge variant="solid" colorScheme="green">
										145 جنيه
									</Badge>{" "}
									و رسوم دخول المزايدة{" "}
									<Badge variant="solid" colorScheme="green">
										165 جنيه
									</Badge>{" "}
									يجب ادراج صور ايصالات الدفع و السداد في الاماكن المخصصة لها و
									الاحتفاظ بالاصل مع الاحتفاظ بطباعة كراسة الشروط و الاحتفاظ
									بالرقم الكودي <br /> <br /> 5- اوافق على جميع الشروط للحصول
									على البيانات و الاشتراك و الدخول في المزايدة الخاصة بتلك الشقق
									مغ موافقة على دفع كافة الرسوم السابقة مع علمي التام و معاينتي
									للموقع محل المزايدة و ان سني قد تجاوز الواحد و العشرين عاما و
									اوافق على المشاركة في المزايدة الخاصة بالشقق المذكورة مع علمي
									التام بكافة الاجراءات و الاحكام و كذلك الرسوم و المصروفات
								</Box>
							</Box>
						</Flex>
					</Container>
				</VStack>
			</Containers>
		</>
	);
};

export default About;
